requisições/req_2026-02-26T14-32-27-713Z_SaveRecord.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tot="http://www.totvs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <tot:SaveRecord>
         <!--Optional:-->
         <tot:DataServerName>GlbConsSqlData</tot:DataServerName>
         <!--Optional:-->
         <tot:XML><![CDATA[<GlbConsSql>
  <GConsSql>
    <CODCOLIGADA>1</CODCOLIGADA>
    <APLICACAO>T</APLICACAO>
    <CODSENTENCA>SIT.PORTALRM.006</CODSENTENCA>
    <TITULO>Retorna Borderôs Pendentes</TITULO>
    <SENTENCA>select *
from FBORDERO
where
codcoligada = 1
/*and STATUSREMESSA = 0*/</SENTENCA>
    <TAMANHO>70</TAMANHO>
    <DTULTALTERACAO>2026-02-26T11:32:27.0000000-03:00</DTULTALTERACAO>
    <USRULTALTERACAO>mestre</USRULTALTERACAO>
    <DISPONIVELFILTRO>1</DISPONIVELFILTRO>
    <DISPONIVELRELATORIO>1</DISPONIVELRELATORIO>
    <DISPONIVELVISAO>1</DISPONIVELVISAO>
    <DISPONIVELMENU>0</DISPONIVELMENU>
    <SEMSEGCOLUNAS>0</SEMSEGCOLUNAS>
    <SEMSEGESTENDIDA>0</SEMSEGESTENDIDA>
    <GUID>840f9567-baab-43af-9750-1f64382636fb</GUID>
    <CONTROLE>36082</CONTROLE>
  </GConsSql>
</GlbConsSql>]]></tot:XML>
         <!--Optional:-->
         <tot:Contexto>CODCOLIGADA=1;CODUSUARIO='mestre';CODSISTEMA=T</tot:Contexto>
      </tot:SaveRecord>
   </soapenv:Body>
</soapenv:Envelope>